# Анализ мнений (NLP - Natural Language Processing).

# Как использовать алгоритмы машинного обучения для классификации документов, основываясь на их направленности: отношении автора.
# Анализ мнений - популярная подотрасль более широкой области - обработки ествественного языка, предназначенная для анализа направленности
# документов (полярности документов).

# Набор данных киноотзывов состоит из 50 000 полярных отзывов о кинофильмах, помеченных, как положительные или отрицательные.
# В данном случае, положительный отзыв означает, что в IMDB фильм получил более 6 звезд от пользователей, а отрицательный, что фильм получил
# менее 5 звезд.
