#  Оценка релевантности слова методом tf-idf (term-frequency - inverse document frequency)
# Когда мы анализируем текстовые данные, мы часто встречаемся со словами в обоих классах (положительный отзыв и отрицательный)
# в двух и более документах. Такие часто встречающиеся слова, как правило, не содержат полезной или отличительной информации.
 # tf-idf - частота термина, обратная частота документа, метод позволяет использоваться для понижающего взвешивания частот
 # часто встречающихся слов в векторах признаков.
