# Кластеризация - алгоритм выделения группы подобных объектов.
# Алгоритм k-средних принадлежит к категории кластеризации на основе прототипов.
# Существует еще две категории кластеризации: иерархическая кластеризация и кластеризация на основе плотности.

# Кластеризация на основе прототипов означает, что каждый кластер представлен прототипом, который может быть либо центроидом (средним),
# подобных точек с непрерывными центрами, либо медоидом (наиболее представительной или наиболее часто встречающейся точкой) в случае
# категориальных признаков.

# Метод к-средних хорошо выполняет идентификацию кластеров сферической формы, но недостаток метода состоит в том, что нам необходимо
# указывать число кластеров к.
